src/integ-test/bdd-test/resources/xml/paVerifyPaymentNotice_noOptional.xml

        
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:paf="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd">
    <soapenv:Header />
    <soapenv:Body>
        <paf:paVerifyPaymentNoticeRes>
            <outcome>$outcome</outcome>
            <paymentList>
                <paymentOptionDescription>
                    <amount>$amount</amount>
                    <options>$options</options>
                    <allCCP>$allCCP</allCCP>
                </paymentOptionDescription>
            </paymentList>
            <paymentDescription>$paymentDescription</paymentDescription>
            <fiscalCodePA>$fiscalCodePA</fiscalCodePA>
            <companyName>$companyName</companyName>
        </paf:paVerifyPaymentNoticeRes>
    </soapenv:Body>
</soapenv:Envelope>